<h1 style="
  font-family: Georgia, serif;
  font-size: 44px;
  text-align: center;
  color: #ef12d2;
  margin: 30px 0 10px 0;
">
Pandas Introduction
</h1>

<p style="
  text-align:center;
  font-size:16px;
  color:#6b7280;
">
Pandas is an open-source Python library used for data manipulation, analysis and cleaning. It provides fast and flexible tools to work with tabular data, similar to spreadsheets or SQL tables.
</p>

<div style="
  background: #f9fafb;
  border-radius: 12px;
  padding: 18px;
  box-shadow: 0 4px 10px rgba(0,0,0,0.08);
  margin: 20px 0;
">
  <h4 style="margin-top:0; color:#111827;">Pandas is used in data Science,ML,Finance</h4>
  <p style="margin-bottom:0; color:black">
    NumPy: numerical operations
    Matplotlib and Seaborn: data visualization
    SciPy: statistical analysis
    Scikit-learn: machine learning workflows
  </p>
</div>

Data Structures 
1.panda Series

2.Panda DataFrame

3.operations-Loading data,viewing and exploring data,
handling missing data,selecting and filtering data,adding and removing columns,grouping data

In [2]:
import pandas as pd
df=pd.DataFrame()
print(df)
lst=['Harshith','vinesh','rao','saritha','rani']
df=pd.DataFrame(lst)
print(df)

Empty DataFrame
Columns: []
Index: []
          0
0  Harshith
1    vinesh
2       rao
3   saritha
4      rani

In [3]:
import numpy as np
data=np.array([[1,2,3],[4,5,6],[7,8,9]])
df=pd.DataFrame(data,columns=['A','B','C'])
print(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
#json resonses often contain lists of dictionaries
dict={'name':['Harshith','vinesh','rao','saritha','rani'],
        'degree':['btech','cse','2nd Year','Law','PG'],
        'score':[89,98,67,99,99]}
df=pd.DataFrame(dict)
print(df)

       name    degree  score
0  Harshith     btech     89
1    vinesh       cse     98
2       rao  2nd Year     67
3   saritha       Law     99
4      rani        PG     99

pandas.DataFrame(data, index, columns) 

Parameters: 

 data: It is a dataset from which a DataFrame is to be created. It can be a list, dictionary, scalar value, series, and arrays, etc. 

 index: It is optional, by default the index of the DataFrame starts from 0 and ends at the last data value(n-1). It defines the row label explicitly.
  
 columns: This parameter is used to provide column names in the DataFrame. If the column name is not defined by default, it will take a value from 0 to n-1. 
Returns:

DataFrame object

In [2]:
import pandas as pd
df=pd.read_csv("people_data.csv")
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

<p style="font-family:Fantasy">
<code>read_csv()</code> function in pandas is used to read data from CSV files into a pandas Dataframe
</p>
<code>pd.read_csv(filepath_or_buffer, sep=' ,' , header='infer',  index_col=None, usecols=None, engine=None, skiprows=None, nrows=None)</code>
<p>filepath_or_buffer: Location of the csv file. It accepts any string path or URL of the file.
sep: It stands for separator, default is ', '.
header: It accepts int, a list of int, row numbers to use as the column names, and the start of the data. If no names are passed, i.e., header=None, then, it will display the first column as 0, the second as 1, and so on.
usecols: Retrieves only selected columns from the CSV file.
nrows: Number of rows to be displayed from the dataset.
index_col: If None, there are no index numbers displayed along with records.  
skiprows: Skips passed rows in the new data frame.</p>

<h2 style="font-family:Cursive">Features</h2>

In [3]:
#read specific columns using read_csv
df=pd.read_csv("people_data.csv",usecols=["First Name","Email"])
print(df)

  First Name                       Email
0     Shelby        elijah57@example.net
1    Phillip       bethany14@example.com
2   Kristine       bthompson@example.com
3    Yesenia   kaitlinkaiser@example.com
4       Lori  buchananmanuel@example.net

In [4]:
#setting an index column
df=pd.read_csv("people_data.csv",index_col="First Name")
print(df)

           Last Name     Sex                       Email Date of birth  \
First Name
Shelby       Terrell    Male        elijah57@example.net    1945-10-26
Phillip      Summers  Female       bethany14@example.com    1910-03-24
Kristine      Travis    Male       bthompson@example.com    1992-07-02
Yesenia     Martinez    Male   kaitlinkaiser@example.com    2017-08-03
Lori            Todd    Male  buchananmanuel@example.net    1938-12-01

                     Job Title
First Name
Shelby         Games developer
Phillip         Phytotherapist
Kristine             Homeopath
Yesenia      Market researcher
Lori        Veterinary surgeon

In [6]:
# handling missing values 
df = pd.read_csv("people_data.csv", na_values=["N/A", "Unknown"])
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

In [7]:
# reading csv files with different delimiters
data="""totalbill_tip, sex:smoker, day_time, size
16.99, 1.01:Female|No, Sun, Dinner, 2
10.34, 1.66, Male, No|Sun:Dinner, 3
21.01:3.5_Male, No:Sun, Dinner, 3
23.68, 3.31, Male|No, Sun_Dinner, 2
24.59:3.61, Female_No, Sun, Dinner, 4
25.29, 4.71|Male, No:Sun, Dinner, 4"""
with open("people_data.csv","w") as file:
    file.write(data)
print(data)

totalbill_tip, sex:smoker, day_time, size
16.99, 1.01:Female|No, Sun, Dinner, 2
10.34, 1.66, Male, No|Sun:Dinner, 3
21.01:3.5_Male, No:Sun, Dinner, 3
23.68, 3.31, Male|No, Sun_Dinner, 2
24.59:3.61, Female_No, Sun, Dinner, 4
25.29, 4.71|Male, No:Sun, Dinner, 4

In [8]:
df=pd.read_csv('people_data.csv',sep='[:,|_]',#define the delimiters
               engine='python')
df

   totalbill   tip      sex smoker   day     time   size
0      16.99  1.01   Female     No   Sun   Dinner      2
1      10.34  1.66     Male     No   Sun   Dinner      3
2      21.01  3.50     Male     No   Sun   Dinner      3
3      23.68  3.31     Male     No   Sun   Dinner      2
4      24.59  3.61   Female     No   Sun   Dinner      4
5      25.29  4.71     Male     No   Sun   Dinner      4

In [10]:
df = pd.read_csv('people_data.csv', nrows=3)
df

                  totalbill_tip  sex:smoker        day_time   size
16.99            1.01:Female|No         Sun          Dinner    2.0
10.34                      1.66        Male   No|Sun:Dinner    3.0
21.01:3.5_Male           No:Sun      Dinner               3    NaN

In [11]:
df=pd.read_csv("people_data.csv")
print("Previous data:\n",df)
df=pd.read_csv("people_data.csv",skiprows=[4,5])
print("after:\n",df)

Previous data:
                   totalbill_tip  sex:smoker        day_time   size
16.99            1.01:Female|No         Sun          Dinner    2.0
10.34                      1.66        Male   No|Sun:Dinner    3.0
21.01:3.5_Male           No:Sun      Dinner               3    NaN
23.68                      3.31     Male|No      Sun_Dinner    2.0
24.59:3.61            Female_No         Sun          Dinner    4.0
25.29                 4.71|Male      No:Sun          Dinner    4.0
after:
                   totalbill_tip  sex:smoker        day_time   size
16.99            1.01:Female|No         Sun          Dinner    2.0
10.34                      1.66        Male   No|Sun:Dinner    3.0
21.01:3.5_Male           No:Sun      Dinner               3    NaN
25.29                 4.71|Male      No:Sun          Dinner    4.0

In [12]:
url = "https://media.geeksforgeeks.org/wp-content/uploads/20241121154629307916/people_data.csv"
df = pd.read_csv(url)
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

<h2 style="font-family:Cursive">Python Pandas series</h2>
<p style="font-family:Cursive">A Pandas Series can be created from different data structures such as lists, NumPy arrays, dictionaries or scalar value.</p>
<header style="font-family:Cursive">
<h3>Accessing elements of Series</h3>
<li>Position-based Indexing</li>
<li>Label-based Indexing</li>
</header>
<header style="font-family:Cursive">
<h3>Indexing and Selecting Data </h3>
<li>Indexing a Series using .loc[]</li>
<li>Indexing a Series using .iloc[]</li>
</header>
<header style="font-family:Cursive">
<h3>Binary Operations on Pandas Series</h3>
</header>
<style>
.cursive-table {
    font-family: "Comic Sans MS", "Brush Script MT", cursive;
    font-size: 16px;
    border-collapse: collapse;
    width: 100%;
}

.cursive-table th, .cursive-table td {
    border: 1px solid #ccc;
    padding: 10px;
    text-align: left;
}

.cursive-table th {
    background-color: #f4f4f4;
}
</style>

<table class="cursive-table">
    <tr>
        <th>Method</th>
        <th>Description</th>
    </tr>
    <tr>
        <td><b>sub()</b></td>
        <td>Method is used to subtract series or list-like objects with same length from the caller series</td>
    </tr>
    <tr>
        <td><b>mul()</b></td>
        <td>Method is used to multiply series or list-like objects with same length with the caller series</td>
    </tr>
    <tr>
        <td><b>div()</b></td>
        <td>Method is used to divide series or list-like objects with same length by the caller series</td>
    </tr>
    <tr>
        <td><b>sum()</b></td>
        <td>Returns the sum of the values for the requested axis</td>
    </tr>
    <tr>
        <td><b>prod()</b></td>
        <td>Returns the product of the values for the requested axis</td>
    </tr>
    <tr>
        <td><b>mean()</b></td>
        <td>Returns the mean of the values for the requested axis</td>
    </tr>
    <tr>
        <td><b>pow()</b></td>
        <td>Method is used to put each element of passed series as exponential power of caller series and return the results</td>
    </tr>
    <tr>
        <td><b>abs()</b></td>
        <td>Method is used to get the absolute numeric value of each element in Series/DataFrame</td>
    </tr>
    <tr>
        <td><b>cov()</b></td>
        <td>Method is used to find covariance of two series</td>
    </tr>
</table>

In [1]:
import pandas as pd
data=[1,2,3,4]
ser=pd.Series(data)
print(ser)

0    1
1    2
2    3
3    4
dtype: int64

In [2]:
import pandas as pd
import numpy as np

data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data)

print(ser[:5])

0    g
1    e
2    e
3    k
4    s
dtype: object

In [3]:
import pandas as pd
import numpy as np

data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data,index=[10,11,12,13,14,15,16,17,18,19,20,21,22])

print(ser[16])

o

In [6]:
sd=pd.read_csv("nba.csv")
ser=pd.Series(sd['Name'])
data=ser.head(10)
print(data)

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
7     Kelly Olynyk
8     Terry Rozier
9     Marcus Smart
Name: Name, dtype: object

In [7]:
data.loc[3:6]

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
Name: Name, dtype: object

In [8]:
#binary operations
ser1 = pd.Series([1, 2, 3], index=['A', 'B', 'C'])
ser2 = pd.Series([4, 5, 6], index=['A', 'B', 'C'])

df_sum = ser1.add(ser2)
print(df_sum)

A    5
B    7
C    9
dtype: int64

<p style="font-family:Cursive">
A Pandas Series is like a single column of data in a spreadsheet. It is a one-dimensional array that can hold many types of data such as numbers, words or even other Python objects
</p>

In [9]:
ser=pd.Series()
ser

Series([], dtype: object)

In [10]:
data=np.array(['h','a','r','s','h','a'])
ser=pd.Series(data)
ser

0    h
1    a
2    r
3    s
4    h
5    a
dtype: object

In [11]:
import pandas as pd

data_list = ['g', 'e', 'e', 'k', 's']

ser = pd.Series(data_list)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [12]:
data_dict={'Harsha':67,'saritha':99,'honey':67}
ser=pd.Series(data_dict)
ser

Harsha     67
saritha    99
honey      67
dtype: int64

In [13]:
sr=pd.Series(np.linspace(1,10,5))
sr

0     1.00
1     3.25
2     5.50
3     7.75
4    10.00
dtype: float64

In [14]:
se=pd.Series(range(5,15))
se

0     5
1     6
2     7
3     8
4     9
5    10
6    11
7    12
8    13
9    14
dtype: int64

In [15]:
s=pd.Series(range(1,20,3),index=[x for x in 'abcdefg'])
s

a     1
b     4
c     7
d    10
e    13
f    16
g    19
dtype: int64

<code>DataFrame.head(n=5)
Series.head(n=5)</code>

In [3]:
import pandas as pd
data=pd.read_csv("nba.csv")
print("NBA Dataset (First 5 rows):\n",data.head())

NBA Dataset (First 5 rows):
             Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0

In [4]:
series=data["Name"]
top=series.head(n=7)
print(top)

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
Name: Name, dtype: object

In [5]:
import pandas as pd

data = pd.read_csv("nba.csv")

salary = data['Salary']

print("First 5 Salaries:")
print(salary.head())

First 5 Salaries:
0    7730337.0
1    6796117.0
2          NaN
3    1148640.0
4    5000000.0
Name: Salary, dtype: float64

In [6]:
salary_name=data[['Name','Salary']].head()
print(salary_name)

            Name     Salary
0  Avery Bradley  7730337.0
1    Jae Crowder  6796117.0
2   John Holland        NaN
3    R.J. Hunter  1148640.0
4  Jonas Jerebko  5000000.0

In [7]:
sorted_data=data.sort_values(by='Age',ascending=True)
top_sorted=sorted_data.head()
print(top_sorted)

                   Name                    Team  Number Position   Age Height  \
226       Rashad Vaughn         Milwaukee Bucks    20.0       SG  19.0    6-6
122        Devin Booker            Phoenix Suns     1.0       SG  19.0    6-6
40   Kristaps Porzingis         New York Knicks     6.0       PF  20.0    7-3
401          Tyus Jones  Minnesota Timberwolves     1.0       PG  20.0    6-2
427     Cliff Alexander  Portland Trail Blazers    34.0       PF  20.0    6-8

     Weight   College     Salary
226   202.0      UNLV  1733040.0
122   206.0  Kentucky  2127840.0
40    240.0       NaN  4131720.0
401   195.0      Duke  1282080.0
427   240.0    Kansas   525093.0

<code>DataFrame.tail(n=5)
Series.tail(n=5)</code>

In [8]:
data=pd.read_csv("nba.csv")
print(data.tail())

             Name       Team  Number Position   Age Height  Weight College  \
453  Shelvin Mack  Utah Jazz     8.0       PG  26.0    6-3   203.0  Butler
454     Raul Neto  Utah Jazz    25.0       PG  24.0    6-1   179.0     NaN
455  Tibor Pleiss  Utah Jazz    21.0        C  26.0    7-3   256.0     NaN
456   Jeff Withey  Utah Jazz    24.0        C  26.0    7-0   231.0  Kansas
457           NaN        NaN     NaN      NaN   NaN    NaN     NaN     NaN

        Salary
453  2433333.0
454   900000.0
455  2900000.0
456   947276.0
457        NaN

In [9]:
series=data["Name"]
bottom=series.tail(n=7)
print(bottom)

451    Chris Johnson
452       Trey Lyles
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, dtype: object

In [10]:
salary_name=data[['Name','Salary']].tail()
salary_name

             Name     Salary
453  Shelvin Mack  2433333.0
454     Raul Neto   900000.0
455  Tibor Pleiss  2900000.0
456   Jeff Withey   947276.0
457           NaN        NaN

<code>describe()</code>
<p style="font-family:Cursive">Pandas generates descriptive statistics of DataFrame columns which provides key metrics like mean, standard deviation, percentiles and more. </p>

<code>DataFrame.describe(percentiles=None, include=None, exclude=None)</code>
<p style="font-family:Cursive">percentiles: A list of numbers between 0 and 1 specifying which percentiles to return. The default is None which returns the 25th, 50th and 75th percentiles.
include: A list of data types to include in the summary like int, float, object for strings. Default is None means all numeric types are included.
exclude: A list of data types to exclude from the summary. Default is None means no types are excluded.</p>

In [11]:
data.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

<li>count: Total number of non-null entries in each column.</li>
<li>mean: Average (mean) of the values in the column.</li>
<li>std: Standard deviation showing how spread out the values are</li>
<li>min: Minimum value in the column</li>
<li>25%: The 25th percentile (Q1) which means 25% of the data points are less than this value.</li>
<li>50%: Median value (50th percentile) where half the data points are below it.</li>
<li>75%: The 75th percentile (Q3) means 75% of the data points are below this value.</li>
<li>max: Maximum value in the column.</li>

In [12]:
desc=data.describe(percentiles=[.20,.40,.60,.80],include=['object','float','int'])
desc

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
count,457,457,457.000000,457,457.000000,457,457.000000,373,4.460000e+02
unique,457,30,NaN,5,NaN,18,NaN,118,NaN
top,Avery Bradley,New Orleans Pelicans,NaN,SG,NaN,6-9,NaN,Kentucky,NaN
freq,1,19,NaN,102,NaN,59,NaN,22,NaN
mean,NaN,NaN,17.678337,NaN,26.938731,NaN,221.522976,NaN,4.842684e+06
std,NaN,NaN,15.966090,NaN,4.404016,NaN,26.368343,NaN,5.229238e+06
min,NaN,NaN,0.000000,NaN,19.000000,NaN,161.000000,NaN,3.088800e+04
20%,NaN,NaN,4.000000,NaN,23.000000,NaN,195.600000,NaN,9.472760e+05
40%,NaN,NaN,10.000000,NaN,25.000000,NaN,213.400000,NaN,1.938840e+06
50%,NaN,NaN,13.000000,NaN,26.000000,NaN,220.000000,NaN,2.839073e+06
60%,NaN,NaN,18.600000,NaN,27.000000,NaN,230.000000,NaN,3.815000e+06
80%,NaN,NaN,30.000000,NaN,30.000000,NaN,245.000000,NaN,8.042895e+06
max,NaN,NaN,99.000000,NaN,40.000000,NaN,307.000000,NaN,2.500000e+07

<li>count: Total number of non-null values</li>
<li>unique: Number of unique values in the column.</li>
<li>top: Most frequent value in the column.</li>
<li>freq: Frequency of the most common value.</li>

In [13]:
desc=data["Name"].describe()
desc

count               457
unique              457
top       Avery Bradley
freq                  1
Name: Name, dtype: object

In [14]:
salary_desc=data["Salary"].describe()
salary_desc

count    4.460000e+02
mean     4.842684e+06
std      5.229238e+06
min      3.088800e+04
25%      1.044792e+06
50%      2.839073e+06
75%      6.500000e+06
max      2.500000e+07
Name: Salary, dtype: float64

<h2 style="font-family:Cursive">Dealing with Rows and Columns in Pandas DataFrame</h1>
<h3 style="font-family:Cursive">dealing with columns</h3>
<li style="font-family:Cursive">Adding columns</li>
<li style="font-family:Cursive">deleting columns</li>
<h3 style="font-family:Cursive">dealing with rows</h3>
<li style="font-family:Cursive">selecting rows</li>
<li style="font-family:Cursive">Adding rows</li>
<li style="font-family:Cursive">Deleting rows</li>
<li style="font-family:Cursive"><code>pd.concat([new_row, df])</code>combines the new row with the existing DataFrame.</li>
<li style="font-family:Cursive"><code>.reset_index(drop=True)</code>resets the index to maintain sequential row numbering.
</li>

In [15]:
df=pd.read_csv('nba.csv')
df[['Name','Age']]

              Name   Age
0    Avery Bradley  25.0
1      Jae Crowder  25.0
2     John Holland  27.0
3      R.J. Hunter  22.0
4    Jonas Jerebko  29.0
..             ...   ...
453   Shelvin Mack  26.0
454      Raul Neto  24.0
455   Tibor Pleiss  26.0
456    Jeff Withey  26.0
457            NaN   NaN

[458 rows x 2 columns]

In [16]:
df['Experience']=10
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Experience
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,10
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,10
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,10
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,10
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,10

In [17]:
df.drop('Experience',axis=1,inplace=True)
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [18]:
data = pd.read_csv("nba.csv", index_col="Name")
first=data.loc["Avery Bradley"]
second=data.loc["R.J. Hunter"]
print(first,"\n\n",second)

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object

 Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [20]:
df=pd.read_csv('nba.csv')
new_row = {
    'Name': 'Geeks',
    'Team': 'Boston',
    'Number': 3,
    'Position': 'PG',
    'Age': 33,
    'Height': '6-2',
    'Weight': 189,
    'College': 'MIT',
    'Salary': 99999
}
df = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)
df.tail(2)

      Name    Team  Number Position   Age Height  Weight College   Salary
457    NaN     NaN     NaN      NaN   NaN    NaN     NaN     NaN      NaN
458  Geeks  Boston     3.0       PG  33.0    6-2   189.0     MIT  99999.0

<code>df.rename(columns={...}, inplace=True)</code>
<p style="font-family:Cursive">renames specified columns in the dictionary.</p>

In [21]:
import pandas as pd
df = pd.DataFrame({'A': [10, 20], 'B': [30, 40], 'C': [50, 60]})
df.rename(columns={'A': 'X', 'B': 'Y'}, inplace=True)
print(df)

    X   Y   C
0  10  30  50
1  20  40  60

<p style="font-family:Cursive">The set_axis method can be used to rename all columns in a DataFrame. This function takes a list of new column names and an axis (0 for rows, 1 for columns) and returns a DataFrame with renamed columns.</p>